{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Metadata describing implemented features, related files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend files used as reference documentation.",
  "frontend/index.css": "Empty stylesheet placeholder with no styles defined.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component wrapping GameRoot in a fullscreen container.",
  "frontend/src/game/engine/collision.ts": "Implements hitbox overlap checks and generates fighter and attack hitboxes.",
  "frontend/src/game/engine/constants.ts": "Defines gameplay constants for physics, arena bounds, attacks, and initial fighter state.",
  "frontend/src/game/engine/simulation.ts": "Runs per-frame game simulation including movement, attacks, hit detection, and state updates.",
  "frontend/src/game/engine/types.ts": "Type definitions for vectors, hitboxes, attacks, fighters, and global game state.",
  "frontend/src/game/engine/useGameLoop.ts": "React hook running a 60 FPS loop, processing input, simulating frames, and detecting game over.",
  "frontend/src/game/GameRoot.tsx": "Controls game screens, manages game state transitions, and renders Stage, HUD, and overlays.",
  "frontend/src/game/input/keybindings.ts": "Keyboard mappings for both players and the pause key.",
  "frontend/src/game/input/useKeyboard.ts": "Tracks real-time keyboard state for both players and detects pause presses.",
  "frontend/src/game/render/assets.ts": "Defines asset paths and provides a preload function that loads all images.",
  "frontend/src/game/render/FighterSprite.tsx": "Renders a fighter sprite with animations, positioning, and attack indicators based on fighter state.",
  "frontend/src/game/render/Stage.tsx": "Displays the game stage background and renders both fighters within the arena.",
  "frontend/src/game/ui/ControlsOverlay.tsx": "Shows a modal overlay listing control bindings for both players with a close button.",
  "frontend/src/game/ui/GameOverScreen.tsx": "Displays the winner and a restart option with visual effects and footer branding.",
  "frontend/src/game/ui/HUD.tsx": "Renders player health bars and a center fight indicator based on current game state.",
  "frontend/src/game/ui/PauseOverlay.tsx": "Shows a pause menu overlay with resume instructions and a resume button.",
  "frontend/src/game/ui/StartScreen.tsx": "Provides the start menu with options to begin the game or view controls, plus footer branding.",
  "frontend/src/game/ui/uiClasses.ts": "Exports shared UI class strings for consistent arcade-style styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading with context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables for light/dark themes, arcade-styled fonts, and custom glow/neon utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles and rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, feature list, image requirements, and pending requests for the Sonic/Tails-inspired fighting game."
}